const examData = {
  tickets: [
    {
      id: 1,
      questions: [
        {
          question: "Ознаки продуктивності програмного забезпечення",
          answer: ""
        },
        {
          question: "Вирахування значень змінних на стадії компіляції (константа \"згортання\"). Вирахування значень функцій на стадіях компіляції (\"згортка\" функцій)",
          answer: ""
        },
        {
          question: "Оптимізація передачі аргументів",
          answer: ""
        }
      ]
    },
    {
      id: 2,
      questions: [
        {
          question: "Надійність програмних систем",
          answer: ""
        },
        {
          question: "Оптимізація алгебраїчних виразів",
          answer: ""
        },
        {
          question: "Оптимізація функцій. Оптимізація розподілу змінних",
          answer: ""
        }
      ]
    },
    {
      id: 3,
      questions: [
        {
          question: "Програмні та організаційні заходи для визначення продуктивності ПЗ",
          answer: ""
        },
        {
          question: "Видалення невикористовуваних змінних",
          answer: ""
        },
        {
          question: "Оптимізація ініціалізації рядків",
          answer: ""
        }
      ]
    },
    {
      id: 4,
      questions: [
        {
          question: "Процеси розробки, їх закони, правила та умови проектування",
          answer: ""
        },
        {
          question: "Видалення копій змінних",
          answer: ""
        },
        {
          question: "Оптимізація \"мертвого\" коду. Оптимізація константних умов",
          answer: ""
        }
      ]
    },
    {
      id: 5,
      questions: [
        {
          question: "Організація та оптимізація даних",
          answer: ""
        },
        {
          question: "Видалення невикористовуваних присвоювань",
          answer: ""
        },
        {
          question: "Організація та оптимізація даних у СКБД",
          answer: ""
        }
      ]
    },
    {
      id: 6,
      questions: [
        {
          question: "Організація та оптимізація програмного коду",
          answer: ""
        },
        {
          question: "Видалення зайвих виразів",
          answer: ""
        },
        {
          question: "Старіння процедурного кешу",
          answer: ""
        }
      ]
    },
    {
      id: 7,
      questions: [
        {
          question: "Організація та оптимізація алгоритмів",
          answer: ""
        },
        {
          question: "Видалення зайвих викликів функцій",
          answer: ""
        },
        {
          question: "Неоптимальні індекси",
          answer: ""
        }
      ]
    },
    {
      id: 8,
      questions: [
        {
          question: "Аналіз знань та алгоритмів",
          answer: ""
        },
        {
          question: "Виконання алгебраїчних спрощень",
          answer: ""
        },
        {
          question: "Неоптимальні статистики",
          answer: ""
        }
      ]
    },
    {
      id: 9,
      questions: [
        {
          question: "Вимоги до проектів",
          answer: ""
        },
        {
          question: "Основні методи оптимізації",
          answer: ""
        },
        {
          question: "Організація та оптимізація даних у СКБД",
          answer: ""
        }
      ]
    },
    {
      id: 10,
      questions: [
        {
          question: "Специфікації завдань",
          answer: ""
        },
        {
          question: "Оптимізація підвиразів",
          answer: ""
        },
        {
          question: "Оптимальне конструювання модулів програмних систем",
          answer: ""
        }
      ]
    },
    {
      id: 11,
      questions: [
        {
          question: "Типи архітектур",
          answer: ""
        },
        {
          question: "Оптимізація арифметичних операцій",
          answer: ""
        },
        {
          question: "Критерії оцінки якості машинної оптимізації",
          answer: ""
        }
      ]
    },
    {
      id: 12,
      questions: [
        {
          question: "Типи кодування",
          answer: ""
        },
        {
          question: "Оптимізація розгалужень",
          answer: ""
        },
        {
          question: "Методики оцінки якості машинної оптимізації",
          answer: ""
        }
      ]
    },
    {
      id: 13,
      questions: [
        {
          question: "Мови, типи платформ, кросплатформеність",
          answer: ""
        },
        {
          question: "Заміна переходів арифметичних операцій",
          answer: ""
        },
        {
          question: "Неоптимальні індекси",
          answer: ""
        }
      ]
    },
    {
      id: 14,
      questions: [
        {
          question: "Оточення середовище програмування і проектування",
          answer: ""
        },
        {
          question: "Видалення зайвих умов",
          answer: ""
        },
        {
          question: "Старіння процедурного кешу",
          answer: ""
        }
      ]
    },
    {
      id: 15,
      questions: [
        {
          question: "Частота оновлення",
          answer: ""
        },
        {
          question: "Видалення завідомо хибних умов",
          answer: ""
        },
        {
          question: "Організація та оптимізація даних у СКБД",
          answer: ""
        }
      ]
    },
    {
      id: 16,
      questions: [
        {
          question: "Частота фіксації помилок",
          answer: ""
        },
        {
          question: "Оптимізація switch",
          answer: ""
        },
        {
          question: "Оптимізація \"мертвого\" коду. Оптимізація константних умов",
          answer: ""
        }
      ]
    },
    {
      id: 17,
      questions: [
        {
          question: "Фактори процесу проектування програмного продукту",
          answer: ""
        },
        {
          question: "Оптимізація switch",
          answer: ""
        },
        {
          question: "Оптимізація ініціалізації рядків",
          answer: ""
        }
      ]
    },
    {
      id: 18,
      questions: [
        {
          question: "Продуктивність у суміжних областях ІТ",
          answer: ""
        },
        {
          question: "Створення таблиць переходів",
          answer: ""
        },
        {
          question: "Оптимізація функцій. Оптимізація розподілу змінних",
          answer: ""
        }
      ]
    },
    {
      id: 19,
      questions: [
        {
          question: "Оптимізація постійних виразів",
          answer: ""
        },
        {
          question: "Оптимізація циклів",
          answer: ""
        },
        {
          question: "Оптимізація передачі аргументів",
          answer: ""
        }
      ]
    },
    {
      id: 20,
      questions: [
        {
          question: "Заміна перемінних константними значень (\"розмноження\" констант)",
          answer: ""
        },
        {
          question: "Оптимізація викликів функцій",
          answer: ""
        },
        {
          question: "Методики оцінки якості машинної оптимізації",
          answer: ""
        }
      ]
    }
  ]
};
